In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe1=DataFrame({'key':['X','Z','Y','Z','X','X'], 'data_set_1':np.arange(6)})

In [3]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [11]:
dframe2=DataFrame({'key':['Q','Y','Z'],'data_set_2': [1,2,3]})

In [12]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [13]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [14]:
pd.merge(dframe1,dframe2,on='key')

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [15]:
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z         3.0
2           2   Y         2.0
3           3   Z         3.0
4           4   X         NaN
5           5   X         NaN

In [16]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [17]:
pd.merge(dframe1,dframe2,on='key',how='right')

   data_set_1 key  data_set_2
0         1.0   Z           3
1         3.0   Z           3
2         2.0   Y           2
3         NaN   Q           1

In [18]:
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [19]:
dframe3=DataFrame({'key': ['X','X','X','Y','Z','Z'],'data_set_3': range(6)})

In [21]:
dframe4=DataFrame({'key':['Y','Y','X','X','Z'],'data_set_4':range(5)})

In [22]:
dframe3

   data_set_3 key
0           0   X
1           1   X
2           2   X
3           3   Y
4           4   Z
5           5   Z

In [23]:
dframe4

   data_set_4 key
0           0   Y
1           1   Y
2           2   X
3           3   X
4           4   Z